app/Http/Helpers/helpers.php

function module_access_merchant_api($key)
{
    $module = ModuleSetting::where('slug', $key)->first();
---
select * from `module_settings` where `slug` = 'agent-money-in' limit 1

function freedom_countries($type)
{
    $country_restriction = CountryRestriction::where('slug', $type)->first();
---
select * from `country_restrictions` where `slug` = 'USER' limit 1