app/Http/Helpers/helpers.php

select * from `currencies` order by `default` desc
---
function all_currencies()
{
    $currencies = Currency::orderByDesc('default')->get();

select `currencies`.*, `transaction_settings`.* from `currencies` inner join `transaction_settings` on `currencies`.`id` = `transaction_settings`.`currency_id` where `transaction_settings`.`slug` = 'money-in'
---
function get_currencies_data()
{
    return Currency::join('transaction_settings', 'currencies.id', '=', 'transaction_settings.currency_id')
        ->where('transaction_settings.slug','money-in')
        ->select('currencies.*','transaction_settings.*')
        ->get()
        ->keyBy('code') // par exemple, si chaque devise a un code unique
        ->toArray();    // convertit en tableau associatif pour Twig

select * from `admin_notifications` where `admin_id` = 1 and not `type` = 'SIDE_NAV' order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `admin_notifications` where `admin_id` = 1 and not `type` = 'SIDE_NAV'
---
function get_admin_notifications()
{
    $notifications = AdminNotification::auth()->whereNot('type', NotificationConst::SIDE_NAV)->latest()->paginate(10);

select * from `agent_notifications` where `agent_id` = 8 order by `created_at` desc limit 5
---
function get_user_notifications()
{
    if (auth()->guard('web')->check()) {
        $notifications = UserNotification::auth()->latest()->take(5)->get();
    } else if (auth()->guard('merchant')->check()) {
        $notifications = MerchantNotification::auth()->latest()->take(5)->get();
    } else if (auth()->guard('agent')->check()) {
        $notifications = AgentNotification::auth()->latest()->take(5)->get();

select * from `languages` where `status` = 1 limit 1
---
function selectedLangDir()
{
    if (session()->get('local')) {
        $default_language = Language::where('code', session()->get('local'))->first();
        $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    } else {
        $default_language = Language::where('status', GlobalConst::ACTIVE)->first();

select * from `agent_wallets` where `agent_id` = 8 limit 1
---
function authWalletBalance()
{
    if (auth()->guard('web')->check()) {
        $wallet = UserWallet::where('user_id', auth()->user()->id)->first();
        return number_format($wallet->balance, 2);
    } else if (auth()->guard('merchant')->check()) {
        $wallet = MerchantWallet::where('merchant_id', auth()->user()->id)->first();
        return number_format($wallet->balance, 2);
    } else if (auth()->guard('agent')->check()) {
        $wallet = AgentWallet::where('agent_id', auth()->user()->id)->first();

select * from `module_settings` where `slug` = 'agent-money-in' limit 1
---
function module_access($key, $module = null)
{
    if (!$module) {
        $module = ModuleSetting::query();
    }
    return $module->where('slug', $key)->first();

select * from `country_restrictions` where `slug` = 'USER' limit 1
---
function freedom_countries($type)
{
    $country_restriction = CountryRestriction::where('slug', $type)->first();