app/Http/Controllers/Admin/Auth/LoginController.php

    protected function createLoginLog($admin)
    {

        $client_ip = request()->ip() ?? false;
        $location = geoip()->getLocation($client_ip);

        $agent = new Agent();

        // $mac = exec('getmac');
        // $mac = explode(" ",$mac);
        // $mac = array_shift($mac);
        $mac = "";

        $data = [
            'admin_id'      => $admin->id,
            'ip'            => $client_ip,
            'mac'           => $mac,
            'city'          => $location['city'] ?? "",
            'country'       => $location['country'] ?? "",
            'longitude'     => $location['lon'] ?? "",
            'latitude'      => $location['lat'] ?? "",
            'timezone'      => $location['timezone'] ?? "",
            'browser'       => $agent->browser() ?? "",
            'os'            => $agent->platform() ?? "",
        ];

        try {
            AdminLoginLogs::create($data);
---
insert into `admin_login_logs` (`admin_id`, `ip`, `mac`, `city`, `country`, `longitude`, `latitude`, `timezone`, `browser`, `os`, `updated_at`, `created_at`) values (1, '127.0.0.1', '', 'New Haven', 'United States', -72.92, 41.31, 'America/New_York', 'Chrome', 'Windows', '2025-05-05 15:42:52', '2025-05-05 15:42:52')

                'time'      => Carbon::now()->diffForHumans(),
                'image'     => get_image($admin->image, 'admin-profile'),
            ];
            AdminNotification::create([
                'type'      => NotificationConst::SIDE_NAV,
                'admin_id'  => $admin->id,
                'message'   => $notification_message,
            ]);
---
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('SIDE_NAV', 1, '{\"title\":\"Lontsi Stive(superadmin) logged in.\",\"time\":\"il y a 1 seconde\",\"image\":\"http:\/\/127.0.0.1:82\/public\/backend\/images\/admin\/profile\/9d363f15-c56d-48d9-bbe5-5eb5383f5706.webp\"}', '2025-05-05 15:42:53', '2025-05-05 15:42:53')

    protected function updateInfo($admin)
    {
        try {
            $admin->update([
                'last_logged_in'    => now(),
                'login_status'      => true,
            ]);
---
update `admins` set `last_logged_in` = '2025-05-05 15:42:53', `login_status` = 1, `admins`.`updated_at` = '2025-05-05 15:42:53' where `id` = 1