app/Http/Controllers/Agent/Auth/RegisterController.php

    public function verifyCode(Request $request, $token)
    {
        $request->merge(['token' => $token]);
        $request->validate([
            'token'     => "required|string|exists:agent_authorizations,token",
            'code'      => "required|array",
            'code.*'    => "required|numeric",
        ]);
        $code = $request->code;
        $code = implode("", $code);
        $otp_exp_sec = BasicSettingsProvider::get()->agent_otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = AgentAuthorization::where("token", $request->token)->where("code", $code)->first();
        if (!$auth_column) {
            return back()->with(['error' => [__('The verification code does not match')]]);
        }
        if ($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {
            $auth_column->delete();
            return redirect()->route('agent.register')->with(['error' => [__('Session expired. Please try again')]]);
        }
        try {
            $auth_column->delete();
---
delete from `agent_authorizations` where `id` = 5

    public function resendCode(Request $request)
    {
        $email = session()->get('register_email');
        $type = session()->get('type');
        $resend = AgentAuthorization::where("email", $email)->first();
        if ($resend) {
            if (Carbon::now() <= $resend->created_at->addMinutes(GlobalConst::USER_VERIFY_RESEND_TIME_MINUTE)) {
                throw ValidationException::withMessages([
                    'code'      => __('You can resend the verification code after') . ' ' . Carbon::now()->diffInSeconds($resend->created_at->addMinutes(GlobalConst::USER_PASS_RESEND_TIME_MINUTE)) . ' ' . __('seconds'),
                ]);
            }
        }

        $code = generate_random_code();
        $data = [
            'agent_id'       =>  0,
            'email'         => $email,
            'code'          => $code,
            'type'          => $type,
            'token'         => generate_unique_string("agent_authorizations", "token", 200),
            'created_at'    => now(),
        ];
        DB::beginTransaction();
        try {
            $oldToken = AgentAuthorization::where("email", $email)->get();
---
select * from `agent_authorizations` where `email` = '676757901' limit 1
select * from `agent_authorizations` where `email` = '676757901'

    public function register(Request $request)
    {
        $basic_settings             = $this->basic_settings;
        $type = session()->get('type');
        $validated = $this->validator($request->all())->validate();
        if ($basic_settings->agent_kyc_verification == true) {
            $user_kyc_fields = SetupKyc::agentKyc()->first()->fields ?? [];
            $validation_rules = $this->generateValidationRules($user_kyc_fields);
            $kyc_validated = Validator::make($request->all(), $validation_rules)->validate();
            $get_values = $this->registerPlaceValueWithFields($user_kyc_fields, $kyc_validated);
        }
        try {
            $validated['phone_code'] = get_country_phone_code($validated['country']);
        } catch (Exception $e) {
            return $this->breakAuthentication($e->getMessage());
        }

        $validated['mobile']        = remove_speacial_char($validated['phone']);
        $validated['mobile_code']   = remove_speacial_char($validated['phone_code']);
        $complete_phone             = $validated['mobile_code'] . $validated['mobile'];

        if (Agent::where('full_mobile', $complete_phone)->exists()) {
---
select exists(select * from `agents` where `full_mobile` = '237676757901') as `exists`