app/Http/Controllers/Agent/DashboardController.php

    public function index()
    {
        $page_title = __("Dashboard");
        $baseCurrency = Currency::default();
        $transactions = Transaction::agentAuth()->latest()->take(5)->get();
        // $data['totalAddMoney'] = Transaction::agentAuth()->addMoney()->where('status', 1)->sum('request_amount');
        $test1 = Transaction::agentAuth()->addSubBalance()->where('status', 1)->orderBy('created_at', 'desc')->first();
        if ($test1) {
            $data['lastAddSubBalance'] = amountOfTransaction($test1);
        } else $data['lastAddSubBalance'] = 0;
        $data['totalAddSubBalance'] = Transaction::agentAuth()->addSubBalance()->where('status', 1)->sum('request_amount');
        // $data['totalWithdrawMoney'] = Transaction::agentAuth()->moneyOut()->where('status', 1)->sum('request_amount');
        $data['totalSendMoney'] = Transaction::agentAuth()->senMoney()->where('status', 1)->sum('request_amount');
        $data['totalMoneyIn'] = Transaction::agentAuth()->moneyIn()->where('status', 1)->sum('request_amount');
        $data['totalReceiveMoney'] = Transaction::agentAuth()->agentMoneyOut()->where('status', 1)->sum('request_amount');;
        $data['totalSendRemittance'] = Transaction::agentAuth()->remitance()->where('attribute', "SEND")->sum('request_amount');
        $data['billPay'] = amountOnBaseCurrency(Transaction::agentAuth()->billPay()->where('status', 1)->get());

        $data['topUps'] = amountOnBaseCurrency(Transaction::agentAuth()->where('status', 1)->mobileTopup()->get());
        $data['total_transaction'] = Transaction::agentAuth()->moneyIn()->where('status', 1)->count();
        $data['agent_profits'] = AgentProfit::agentAuth()->where('paid', '0')->sum('total_charge');
        $basicSetting = BasicSettings::first();
---
select * from `transactions` where `agent_id` = 8 order by `created_at` desc limit 5
select * from `transactions` where `agent_id` = 8 and `type` = 'ADD-SUBTRACT-BALANCE' and `status` = 1 order by `created_at` desc limit 1
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `type` = 'AGENT-MONEY-OUT' and `status` = 1
select * from `transactions` where `agent_id` = 1 and `type` = 'BILL-PAY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 2 and `type` = 'MONEY-IN' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 2 and `type` = 'AGENT-MONEY-OUT' and `status` = 1
select * from `transactions` where `agent_id` = 1 and `status` = 1 and `type` = 'MOBILE-TOPUP'
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 8 and `type` = 'AGENT-MONEY-OUT' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 8 and `type` = 'REMITTANCE' and `attribute` = 'SEND'
select * from `transactions` where `agent_id` = 8 and `type` = 'BILL-PAY' and `status` = 1
select * from `transactions` where `agent_id` = 8 and `status` = 1 and `type` = 'MOBILE-TOPUP'
select count(*) as aggregate from `transactions` where `agent_id` = 8 and `type` = 'MONEY-IN' and `status` = 1
select sum(`total_charge`) as aggregate from `agent_profits` where `agent_id` = 8 and `paid` = '0'
select * from `basic_settings` limit 1

            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::agentAuth()->where('type', PaymentGatewayConst::MONEYIN)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();
            $success = Transaction::agentAuth()->where('type', PaymentGatewayConst::MONEYIN)
                ->whereDate('created_at', $start_date)
                ->where('status', 1)
                ->count();
            $canceled = Transaction::agentAuth()->where('type', PaymentGatewayConst::MONEYIN)
                ->whereDate('created_at', $start_date)
                ->where('status', 4)
                ->count();
            $hold = Transaction::agentAuth()->where('type', PaymentGatewayConst::MONEYIN)
                ->whereDate('created_at', $start_date)
                ->where('status', 3)
                ->count();
---
select count(*) as aggregate from `transactions` where `agent_id` = 2 and `type` = 'MONEY-IN' and date(`created_at`) = '2024-09-01' and `status` = 2
select count(*) as aggregate from `transactions` where `agent_id` = 2 and `type` = 'MONEY-IN' and date(`created_at`) = '2024-09-01' and `status` = 1
select count(*) as aggregate from `transactions` where `agent_id` = 2 and `type` = 'MONEY-IN' and date(`created_at`) = '2024-09-01' and `status` = 4
select count(*) as aggregate from `transactions` where `agent_id` = 8 and `type` = 'MONEY-IN' and date(`created_at`) = '2025-05-01' and `status` = 3

            $hold_data[]     = $hold;

            // Monthley money Out
            $money_pending = Transaction::agentAuth()->where('type', PaymentGatewayConst::TYPEADDSUBTRACTBALANCE)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();
            $money_success = Transaction::agentAuth()->where('type', PaymentGatewayConst::TYPEADDSUBTRACTBALANCE)
                ->whereDate('created_at', $start_date)
                ->where('status', 1)
                ->count();
            $money_canceled = Transaction::agentAuth()->where('type', PaymentGatewayConst::TYPEADDSUBTRACTBALANCE)
                ->whereDate('created_at', $start_date)
                ->where('status', 4)
                ->count();
            $money_hold = Transaction::agentAuth()->where('type', PaymentGatewayConst::TYPEADDSUBTRACTBALANCE)
                ->whereDate('created_at', $start_date)
                ->where('status', 3)
                ->count();
---
select count(*) as aggregate from `transactions` where `agent_id` = 2 and `type` = 'ADD-SUBTRACT-BALANCE' and date(`created_at`) = '2024-09-01' and `status` = 2
select count(*) as aggregate from `transactions` where `agent_id` = 2 and `type` = 'ADD-SUBTRACT-BALANCE' and date(`created_at`) = '2024-09-01' and `status` = 1
select count(*) as aggregate from `transactions` where `agent_id` = 2 and `type` = 'ADD-SUBTRACT-BALANCE' and date(`created_at`) = '2024-09-01' and `status` = 4
select count(*) as aggregate from `transactions` where `agent_id` = 8 and `type` = 'ADD-SUBTRACT-BALANCE' and date(`created_at`) = '2025-05-01' and `status` = 3