app/Http/Controllers/Agent/MoneyInController.php

select * from `transaction_settings` where `slug` = 'money-in' and `status` = 1 limit 1
select * from `transactions` where `agent_id` = 8 and `type` = 'MONEY-IN' order by `created_at` desc limit 10
select `currencies`.`code`, `transaction_settings`.`min_limit`, `transaction_settings`.`max_limit`, `transaction_settings`.`percent_charge`, `transaction_settings`.`fixed_charge` from `currencies` inner join `transaction_settings` on `currencies`.`id` = `transaction_settings`.`currency_id` where `transaction_settings`.`slug` = 'money-in'
select `currencies`.`code`, `agent_wallets`.`balance`, `agent_wallets`.`id` from `agent_wallets` inner join `currencies` on `currencies`.`id` = `agent_wallets`.`currency_id` where `agent_wallets`.`status` = 1 and `agent_wallets`.`agent_id` = 8
---
    public function index()
    {
        $page_title = __("Money In");
        $moneyInCharge = TransactionSetting::where('slug', 'money-in')->where('status', 1)->first();
        $transactions = Transaction::agentAuth()->moneyIn()->latest()->take(10)->get();
        $currencies = Currency::join('transaction_settings', 'currencies.id', '=', 'transaction_settings.currency_id')
        ->where('transaction_settings.slug','money-in')
        ->select('currencies.code','transaction_settings.min_limit','transaction_settings.max_limit','transaction_settings.percent_charge','transaction_settings.fixed_charge')
        ->get()
        ->keyBy('code') // par exemple, si chaque devise a un code unique
        ->toArray();
        $wallets = AgentWallet::where('agent_wallets.status', 1)
        ->where('agent_wallets.agent_id', auth()->id())  // Ajout de la condition pour l'agent authentifié
        ->join('currencies', 'currencies.id', '=', 'agent_wallets.currency_id')
        ->select('currencies.code', 'agent_wallets.balance', 'agent_wallets.id')
        ->get()->keyBy('code')->toArray();

select * from `basic_settings` limit 1
---
    public function confirmedMoneyIn(Request $request)
    {
        $validated = Validator::make($request->all(), [
            'amount' => 'required|numeric|gt:0',
            'email' => 'required',
            'mobile' => 'required',
            'currency_id' => 'required',
            // 'password' => 'required'
        ])->validate();

        $basic_setting = BasicSettings::first();

select * from `user_wallets` where `user_id` = 29 and `currency_id` = '6' limit 1
---
            $receiver->save();
        }

        $receiver_wallet = UserWallet::where("user_id", $receiver->id)->where("currency_id", $validated['currency_id'])->first();

select * from `transaction_settings` where `slug` = 'money-in' and `currency_id` = '6' and `status` = 1 limit 1
---
            return back()->with(['error' => [__("Receiver wallet not found")]]);
        }

        $trx_charges =  TransactionSetting::where('slug', 'money-in')->where('currency_id', $validated['currency_id'])->where('status', 1)->first();

select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'money-out' and `status` = 1) and `alias` = 'cbs-xaf-money-out' limit 1
---
            } catch (Exception $e) {
            }
            try {
                $gate = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
                    $gateway->where('slug', PaymentGatewayConst::money_out_slug());
                    $gateway->where('status', 1);
                })->where('alias', 'cbs-xaf-money-out')->first();

select * from `users` where `users`.`id` = 29 limit 1
---
    public function insertSender($trx_id, $sender_wallet, $charges, $receiver_wallet, $adminID)
    {
        $trx_id = $trx_id;
        $authWallet = $sender_wallet;
        $afterCharge = ($authWallet->balance - $charges['payable']); // + $charges['agent_total_commission'];

        DB::beginTransaction();
        try {
            $id = DB::table("transactions")->insertGetId([
                'agent_id'                      => $sender_wallet->agent->id,
                'admin_id'                      => $adminID,
                'agent_wallet_id'               => $sender_wallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::MONEYIN,
                'trx_id'                        => $trx_id,
                'request_amount'                => $charges['sender_amount'],
                'payable'                       => $charges['payable'],
                'available_balance'             => $afterCharge,
                'cbsTransfert'                  => 'ND',
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::MONEYIN, " ")) . " To " . $receiver_wallet->user->fullname,
                'details'                       => json_encode([
                    'receiver_username' => $receiver_wallet->user->username,
                    'receiver_name' => $receiver_wallet->user->firstname .' '. $receiver_wallet->user->lastname,
                    'receiver_matricule' => $receiver_wallet->user->matricule,
                    'receiver_email' => $receiver_wallet->user->email,
                    'sender_username' => $sender_wallet->agent->username,
                    'sender_email' => $sender_wallet->agent->email,
                    'sender_matricule' => $sender_wallet->agent->matricule,
                    'sender_name' => $sender_wallet->agent->firstname.' '.$sender_wallet->agent->lastname,
                    'charges' => $charges
                ]),

insert into `agent_profits` (`agent_id`, `transaction_id`, `paid`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (8, 111, '0', 0.05, 0, 0.05, '2025-05-05 09:37:05')
---
    public function agentProfitInsert($id, $authWallet, $charges)
    {
        DB::beginTransaction();
        try {
            DB::table('agent_profits')->insert([
                'agent_id'          => $authWallet->agent->id,
                'transaction_id'    => $id,
                'paid'    => '0',
                'percent_charge'    => $charges['agent_percent_commission'],
                'fixed_charge'      => $charges['agent_fixed_commission'],
                'total_charge'      => $charges['agent_total_commission'],
                'created_at'        => now(),
            ]);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (111, 0.25, 0, 0.25, '2025-05-05 09:37:05')
insert into `agent_notifications` (`type`, `agent_id`, `message`, `updated_at`, `created_at`) values ('MONEY-IN', 8, '{\"title\":\"Money IN\",\"message\":\"Money In To  MARILYN PONGO MOPO 25 USD Successful\",\"image\":\"http:\/\/127.0.0.1:82\/public\/backend\/images\/default\/default.webp\"}', '2025-05-05 09:37:05', '2025-05-05 09:37:05')
---
    public function insertSenderCharges($id, $charges, $sender_wallet, $receiver_wallet)
    {
        DB::beginTransaction();
        try {
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $charges['percent_charge'],
                'fixed_charge'      => $charges['fixed_charge'],
                'total_charge'      => $charges['total_charge'],
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         => __("Money IN"),
                'message'       => "Money In To  " . $receiver_wallet->user->fullname . ' ' . $charges['sender_amount'] . ' ' . $charges['sender_currency'] . " Successful",
                'image'         =>  get_image($sender_wallet->agent->image, 'agent-profile'),
            ];
            AgentNotification::create([
                'type'      => NotificationConst::MONEYIN,
                'agent_id'  => $sender_wallet->agent->id,
                'message'   => $notification_content,
            ]);

update `user_wallets` set `balance` = 24.75, `user_wallets`.`updated_at` = '2025-05-05 09:37:08' where `id` = 20
---
    public function updateReceiverWalletBalance($receiverWallet, $recipient_amount)
    {
        $receiverWallet->update([
            'balance'   => $recipient_amount,
        ]);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (112, 0, 0, 0, '2025-05-05 09:37:08')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('MONEY-IN', 29, '{\"title\":\"Argent entrant\",\"message\":\"Money In From  ONANA VINCENT 24.75 XAF Successful\",\"image\":\"http:\/\/127.0.0.1:82\/public\/backend\/images\/default\/default.webp\"}', '2025-05-05 09:37:08', '2025-05-05 09:37:08')
---
    public function insertReceiverCharges($id, $charges, $sender_wallet, $receiver_wallet)
    {
        DB::beginTransaction();
        try {
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => 0,
                'fixed_charge'      => 0,
                'total_charge'      => 0,
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         => __("Money In"),
                'message'       => "Money In From  " . $sender_wallet->agent->fullname . ' ' . $charges['receiver_amount'] . ' ' . $charges['receiver_currency'] . " Successful",
                'image'         => get_image($receiver_wallet->user->image, 'user-profile'),
            ];
            UserNotification::create([
                'type'      => NotificationConst::MONEYIN,
                'user_id'   => $receiver_wallet->user->id,
                'message'   => $notification_content,
            ]);

select * from `payment_gateways` where `id` = 34 limit 1
---
    public function cbsMoneyOut($trx_id)
    {
        $moneyOutData = (object)session()->get('moneyoutData');
        $gateway = PaymentGateway::where('id', $moneyOutData->gateway_id)->first();

select * from `user_wallets` where `id` = 20 and `user_id` = 29 limit 1
insert into `transactions` (`user_id`, `user_wallet_id`, `agent_id`, `payment_gateway_currency_id`, `type`, `trx_id`, `request_amount`, `payable`, `available_balance`, `remark`, `details`, `status`, `callback_ref`, `cbsTransfert`, `created_at`) values (29, 20, 8, 30, 'MONEY-OUT', 'MI85946658', 24.75, 24.75, 0, 'MONEYOUT by CBS', '[]', 2, '', 'ND', '2025-05-05 09:37:12')
update `user_wallets` set `balance` = 0, `user_wallets`.`updated_at` = '2025-05-05 09:37:12' where `id` = 20
---
    public function insertRecordManual($moneyOutData, $gateway, $get_values, $reference, $status)
    {

        $trx_id = $moneyOutData->trx_id ?? 'MO' . getTrxNum();
        $authWallet = UserWallet::where('id', $moneyOutData->wallet_id)->where('user_id', $moneyOutData->user_id)->first();
        if ($moneyOutData->gateway_type != "AUTOMATIC") {
            $afterCharge = ($authWallet->balance - ($moneyOutData->amount));
        } else {
            $afterCharge = $authWallet->balance;
        }

        DB::beginTransaction();
        try {
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $moneyOutData->user_id,
                'user_wallet_id'                => $moneyOutData->wallet_id,
                'agent_id'                      => $moneyOutData->agent,
                'payment_gateway_currency_id'   => $moneyOutData->gateway_currency_id,
                'type'                          => PaymentGatewayConst::TYPEMONEYOUT,
                'trx_id'                        => $trx_id,
                'request_amount'                => $moneyOutData->amount,
                'payable'                       => $moneyOutData->will_get,
                'available_balance'             => $afterCharge,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPEMONEYOUT, " ")) . " by " . $gateway->name,
                'details'                       => json_encode($get_values),
                'status'                        => $status,
                'callback_ref'                  => $reference ?? null,
                'cbsTransfert'                  => 'ND',
                'created_at'                    => now(),
            ]);
            if ($moneyOutData->gateway_type != "AUTOMATIC") {
                $this->updateWalletBalanceManual($authWallet, $afterCharge);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (113, 0, 0, 0, '2025-05-05 09:37:12')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('WITHDRAW', 29, '{\"title\":\"Retirer de l\'argent\",\"message\":\"Votre demande de retrait envoy\u00e9e \u00e0 l\'administrateur 24.75 XAF R\u00e9ussi\",\"image\":\"http:\/\/127.0.0.1:82\/public\/backend\/images\/default\/default.webp\"}', '2025-05-05 09:37:12', '2025-05-05 09:37:12')
---
    public function insertChargesManual($moneyOutData, $id)
    {

        if (Auth::guard(get_auth_guard())->check()) {
            $user = auth()->guard(get_auth_guard())->user();
        }
        DB::beginTransaction();
        try {
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $moneyOutData->gateway_percent_charge,
                'fixed_charge'      => $moneyOutData->gateway_fixed_charge,
                'total_charge'      => $moneyOutData->gateway_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         => __("Withdraw Money"),
                'message'       => __("Your Withdraw Request Send To Admin") . " " . $moneyOutData->amount . ' ' . get_default_currency_code() . " " . __("Successful"),
                'image'         => get_image($user->image, 'user-profile'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::MONEY_OUT,
                'user_id'  =>  $moneyOutData->user_id,
                'message'   => $notification_content,
            ]);