app/Http/Controllers/Api/Agent/Auth/LoginController.php

    public function login2(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|email|max:50',
            // 'password' => 'required|min:6',
        ]);

        if ($validator->fails()) {
            $error =  ['error' => $validator->errors()->all()];
            return ApiHelpers::validation($error);
        }
        $user = Agent::where('email', $request->email)->first();
---
select * from `agents` where `email` = 'onana.vincent@yahoo.com' limit 1