app/Http/Controllers/CoordinateController.php

        function generateRandomFloat($min = -0.01, $max = 0.01)
        {
            return mt_rand($min * 100, $max * 100) / 100;
        }

        // Utilisation
        $randomFloat = generateRandomFloat();

        // Création de la coordonnée
        $coordinate = Coordinate::create([
            'latitude' => $validatedData['latitude'] + $randomFloat,
            'longitude' => $validatedData['longitude'],
            'agent_id' => $validatedData['id'], // Auth::id(),
        ]);
---
insert into `coordinates` (`latitude`, `longitude`, `agent_id`, `updated_at`, `created_at`) values (3.8761, 11.5154, 1, '2024-09-13 13:23:07', '2024-09-13 13:23:07')