app/Http/Controllers/GlobalController.php

select * from `basic_settings` limit 1
---
    public static function send_sms(array $request)
    {
        $sms_config = BasicSettings::first()->sms_config;