app/Models/Agent.php

    public function getLastLoginAttribute()
    {
        if ($this->loginLogs()->count() > 0) {
---
select * from `agent_login_logs` where `agent_login_logs`.`agent_id` = 1 and `agent_login_logs`.`agent_id` is not null
select count(*) as aggregate from `agent_login_logs` where `agent_login_logs`.`agent_id` is null and `agent_login_logs`.`agent_id` is not null