app/Models/Transaction.php

select * from `admins` where `admins`.`id` = 1 limit 1
---
    public function admin()
    {
        return Admin::find($this->admin_id);