app/Models/User.php

    public function getLastLoginAttribute()
    {
        if ($this->loginLogs()->count() > 0) {
---
select * from `user_login_logs` where `user_login_logs`.`user_id` = 25 and `user_login_logs`.`user_id` is not null
select count(*) as aggregate from `user_login_logs` where `user_login_logs`.`user_id` = 24 and `user_login_logs`.`user_id` is not null