app/Http/Controllers/Admin/AgentCareController.php

select `agents`.*, SUM(CASE WHEN agent_profits.paid = 0 THEN agent_profits.total_charge ELSE 0 END) as commissions from `agents` left join `agent_profits` on `agents`.`id` = `agent_profits`.`agent_id` group by `agents`.`id` order by `agents`.`id` desc limit 12 offset 0
select * from `agents` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `agents`
---
    public function index()
    {
        $page_title = __("All Agents");
        // $agents = Agent::orderBy('id', 'desc')->paginate(12);
        $agents = Agent::with('wallets')->leftJoin('agent_profits', 'agents.id', '=', 'agent_profits.agent_id')
                        ->select('agents.*',
                            DB::raw('SUM(CASE WHEN agent_profits.paid = 0 THEN agent_profits.total_charge ELSE 0 END) as commissions')
                        ) // Calcul de la somme des `total_charge` où le statut est 0
                        ->groupBy('agents.id') // Grouper par agent pour la somme
                        ->orderBy('agents.id', 'desc')
                        ->paginate(12);

select `agents`.*, SUM(CASE WHEN agent_profits.paid = 0 THEN agent_profits.total_charge ELSE 0 END) as commissions from `agents` left join `agent_profits` on `agents`.`id` = `agent_profits`.`agent_id` group by `agents`.`id` order by `agents`.`id` desc limit 20 offset 0
---
    public function active()
    {
        $page_title = __("Active Agent");
        // $agents = Agent::active()->orderBy('id', 'desc')->paginate(12);
        // Joindre la table `agent_profits` et récupérer le champ `total_charge` with('wallets')->active()
        $agents = Agent::leftJoin('agent_profits', 'agents.id', '=', 'agent_profits.agent_id')
                        ->select('agents.*',
                            DB::raw('SUM(CASE WHEN agent_profits.paid = 0 THEN agent_profits.total_charge ELSE 0 END) as commissions')
                        ) // Calcul de la somme des `total_charge` où le statut est 0
                        ->groupBy('agents.id') // Grouper par agent pour la somme
                        ->orderBy('agents.id', 'desc')
                        ->paginate(20);

select * from `agents` where `username` = 'onanavincent' limit 1
select * from `agent_wallets` where `agent_id` = 8
select * from `currencies` where `currencies`.`id` in (1, 6, 7, 11)
select * from `basic_settings` limit 1
---
    public function userDetails($username)
    {
        $page_title = __("Agent Details");
        $user = Agent::where('username', $username)->first();
        if (!$user) return back()->with(['error' => ['Opps! Agent not exists']]);
        /* $balances = AgentWallet::join('currencies', 'currencies.id', '=', 'agent_wallets.currency_id')
            ->where('agent_wallets.agent_id', $user->id)
            ->select('agent_wallets.*', 'currencies.code')
            ->get(); ->balance ?? 0;*/
        // $balances = AgentWallet::where('agent_id', $user->id)->get();
        $balances = AgentWallet::where('agent_id', $user->id)->with('currency')->get();
        // $money_in_amount = Transaction::where('agent_id', $user->id)->where('type', PaymentGatewayConst::MONEYIN)->where('attribute', PaymentGatewayConst::SEND)->where('status', 1)->sum('request_amount');
        // $add_money_amount = Transaction::where('agent_id', $user->id)->where('type', PaymentGatewayConst::TYPEADDMONEY)->where('status', 1)->sum('request_amount');
        // $money_out_amount = Transaction::where('agent_id', $user->id)->where('type', PaymentGatewayConst::TYPEMONEYOUT)->where('status', 1)->sum('request_amount');
        // $total_transaction = Transaction::where('agent_id', $user->id)->where('status', 1)->sum('request_amount');
        // $agent_profits = AgentProfit::where('agent_id', $user->id)->where('paid', '0')->sum('total_charge');
        $data = [
            'balances'              => $balances,
            /* 'total_transaction'    => $total_transaction,
            'add_money_amount'    => $add_money_amount,
            'money_out_amount'    => $money_out_amount,
            'agent_profits'    => $agent_profits,
            'money_in_amount'    => $money_in_amount, */
        ];
        $basicSetting = BasicSettings::first();

select * from `agents` where `username` = 'onanavincent' limit 1
---
    public function loginAsMember(Request $request, $username)
    {
        $admin = Auth::user();
        $request->merge(['username' => $username]);
        $request->validate([
            'target'            => 'required|string|exists:agents,username',
            'username'          => 'required_without:target|string|exists:agents',
        ]);

        try {
            $user = Agent::where("username", $request->username)->first();

select * from `basic_settings` limit 1
select * from `agents` where `agents`.`id` = 8 limit 1
select * from `agent_wallets` where exists (select * from `agents` where `agent_wallets`.`agent_id` = `agents`.`id` and `username` = 'onanavincent') and `agent_wallets`.`id` = '28' limit 1
select count(*) as aggregate from `transactions` where `agent_id` = 8 and `type` = 'MONEY-IN' and `cbsTransfert` = 'ND' and `status` = 1
---
    public function walletBalanceUpdate(Request $request, $username)
    {
        $validator = Validator::make($request->all(), [
            'type'      => "required|string|in:add,subtract",
            'wallet'    => "required|numeric|exists:agent_wallets,id",
            'amount'    => "required|numeric",
            'remark'    => "required|string|max:200",
        ]);

        if ($validator->fails()) {
            return back()->withErrors($validator)->withInput()->with('modal', 'wallet-balance-update-modal');
        }
        $validated = $validator->validate();

        // 27/08/2024
        $basic_setting = BasicSettings::first();
        if ($basic_setting->plafond_collect < $validated['amount']) return back()->with(['error' => [__("Amount must be under 300 000 XAF!")]]);

        $user_wallet = AgentWallet::whereHas('agent', function ($q) use ($username) {
            $q->where('username', $username);
        })->find($validated['wallet']);
        if (!$user_wallet) return back()->with(['error' => [__("Agent wallet not found!")]]);

        $hold = Transaction::where('agent_id', $user_wallet->agent->id)->where('type', PaymentGatewayConst::MONEYIN)
            ->where('cbsTransfert', 'ND')
            ->where('status', 1)
            ->count();

insert into `transactions` (`admin_id`, `agent_id`, `agent_wallet_id`, `type`, `attribute`, `trx_id`, `request_amount`, `payable`, `available_balance`, `remark`, `status`, `created_at`) values (1, 8, 28, 'ADD-SUBTRACT-BALANCE', 'RECEIVED', 'FsXYm1wVoXftCaZq', '100000', '100000', 100000, 'RECHARGE DU JOUR', 1, '2025-05-05 09:32:52')
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (107, 0, 0, 0, '2025-05-05 09:32:52')
---
                    break;
            }

            $inserted_id = DB::table("transactions")->insertGetId([
                'admin_id'          => auth()->user()->id,
                'agent_id'           => $user_wallet->agent->id,
                'agent_wallet_id'    => $user_wallet->id,
                'type'              => PaymentGatewayConst::TYPEADDSUBTRACTBALANCE,
                'attribute'         => $validated['type'] === 'subtract' ? PaymentGatewayConst::SEND : PaymentGatewayConst::RECEIVED,
                'trx_id'            => generate_unique_string("transactions", "trx_id", 16),
                'request_amount'    => $validated['amount'],
                'payable'           => $validated['amount'],
                'available_balance' => $user_wallet_balance,
                'remark'            => $validated['remark'],
                'status'            => GlobalConst::SUCCESS,
                'created_at'                    => now(),
            ]);


            DB::table('transaction_charges')->insert([
                'transaction_id'    => $inserted_id,
                'percent_charge'    => 0,
                'fixed_charge'      => 0,
                'total_charge'      => 0,
                'created_at'        => now(),
            ]);

insert into `agent_notifications` (`type`, `agent_id`, `message`, `updated_at`, `created_at`) values ('BALANCE_UPDATE', 8, '{\"title\":\"Mettre \u00e0 jour le solde\",\"message\":\"Your Wallet (LEUR) Balance Has Been Added\",\"time\":\"il y a 1 seconde\",\"image\":\"http:\/\/127.0.0.1:82\/public\/backend\/images\/default\/profile-default.webp\"}', '2025-05-05 09:32:52', '2025-05-05 09:32:52')
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('BALANCE_UPDATE', 1, '{\"title\":\"onanavincent\'s  Wallet (LEUR) Balance Has Been Added\",\"message\":\"Your Wallet (LEUR) Balance Has Been Added\",\"time\":\"il y a 1 seconde\",\"image\":\"http:\/\/127.0.0.1:82\/public\/backend\/images\/default\/profile-default.webp\"}', '2025-05-05 09:32:52', '2025-05-05 09:32:52')
---
                'time'          => Carbon::now()->diffForHumans(),
                'image'         => files_asset_path('profile-default'),
            ];
            AgentNotification::create([
                'type'      => NotificationConst::BALANCE_UPDATE,
                'agent_id'  => $user_wallet->agent->id,
                'message'   => $notification_content,
            ]);

            //admin notification
            $notification_content['title'] = $user_wallet->agent->username . "'s  Wallet (" . $user_wallet->currency->code . ") Balance Has Been " . $type ?? "";
            AdminNotification::create([
                'type'      => NotificationConst::BALANCE_UPDATE,
                'admin_id'  => 1,
                'message'   => $notification_content,
            ]);