app/Http/Controllers/Admin/AgenceController.php

    public function getAgencies(Request $request)
    {
        $agences = Agence::all();
---
select * from `agences`