app/Http/Controllers/Admin/AgentCareController.php

    public function userDetails($username)
    {
        $page_title = __("Agent Details");
        $user = Agent::where('username', $username)->first();
        if (!$user) return back()->with(['error' => ['Opps! Agent not exists']]);
        $balance = AgentWallet::where('agent_id', $user->id)->first()->balance ?? 0;
        $money_in_amount = Transaction::where('agent_id', $user->id)->where('type', PaymentGatewayConst::MONEYIN)->where('attribute', PaymentGatewayConst::SEND)->where('status', 1)->sum('request_amount');
        $add_money_amount = Transaction::where('agent_id', $user->id)->where('type', PaymentGatewayConst::TYPEADDMONEY)->where('status', 1)->sum('request_amount');
        $money_out_amount = Transaction::where('agent_id', $user->id)->where('type', PaymentGatewayConst::TYPEMONEYOUT)->where('status', 1)->sum('request_amount');
        $total_transaction = Transaction::where('agent_id', $user->id)->where('status', 1)->sum('request_amount');
        $agent_profits = AgentProfit::where('agent_id', $user->id)->where('paid', '0')->sum('total_charge');
        $data = [
            'balance'              => $balance,
            'total_transaction'    => $total_transaction,
            'add_money_amount'    => $add_money_amount,
            'money_out_amount'    => $money_out_amount,
            'agent_profits'    => $agent_profits,
            'money_in_amount'    => $money_in_amount,
        ];
        $basicSetting = BasicSettings::first();
---
select * from `agents` where `username` = 'lontsi' limit 1
select * from `agent_wallets` where `agent_id` = 1 limit 1
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `type` = 'MONEY-IN' and `attribute` = 'SEND' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `type` = 'ADD-MONEY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `type` = 'MONEY-OUT' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `agent_id` = 1 and `status` = 1
select sum(`total_charge`) as aggregate from `agent_profits` where `agent_id` = 1 and `paid` = '0'
select * from `basic_settings` limit 1