app/Http/Controllers/Admin/CurrencyController.php

select * from `currencies` order by `default` desc limit 10 offset 0
select count(*) as aggregate from `currencies`
---
    public function index()
    {
        $page_title = __("Setup Currency");
        $currencies = Currency::orderByDesc('default')->paginate(10);

insert into `currencies` (`admin_id`, `code`, `country`, `created_at`, `default`, `name`, `rate`, `receiver`, `sender`, `symbol`, `type`) values (1, 'LEUR', 'Liberia', '2025-05-04 23:06:00', 0, 'Liberian euro', '650', 1, 1, '€', 'FIAT')
---
        $datas[] = $validated;
        DB::beginTransaction();
        // try{
            DB::table("currencies")->insert($datas);

select * from `currencies` where `code` = 'LEUR' limit 1
---
            return back()->withErrors($validator)->withInput()->with(['error' => [__("Something went wrong! Please try again.")]]);
        } */

        $currency = Currency::where('code', $validated['code'])->first();

update `currencies` set `flag` = 'c6cdc5c4-3bb1-4f7d-8b78-9ce9be39a84e.webp', `currencies`.`updated_at` = '2025-05-04 23:06:01' where `id` = 11
---
                $uploadFlag = upload_files_from_path_dynamic($image,'currency-flag');

                // Update Database
                $currency->update([
                    'flag'  => $uploadFlag,
                ]);

select * from `agents`
select * from `users`
---
    protected function registered()
    {
        $agents = Agent::all();
                    // ->toArray();

        foreach($agents as $row => $agent) {
            $this->createAgentWallets($agent);
        }

        $users = User::all();

insert into `agent_wallets` (`agent_id`, `balance`, `created_at`, `currency_id`, `status`) values (6, 0, '2025-05-04 23:06:00', 11, 1)
---
    protected function createAgentWallets($agent){
        $currencies = Currency::active()->roleHasOne()->pluck("id")->toArray();
        $wallets = [];
        foreach($currencies as $currency_id) {
            if($agent->wallets()->where('currency_id',$currency_id)->count() > 0) {
                continue;
            }
            $wallets[] = [
                'agent_id'      => $agent->id,
                'currency_id'   => $currency_id,
                'balance'       => 0,
                'status'        => true,
                'created_at'    => now(),
            ];
        }

        DB::table("agent_wallets")->insert($wallets);

select count(*) as aggregate from `user_wallets` where `user_wallets`.`user_id` = 24 and `user_wallets`.`user_id` is not null and `currency_id` = 1
insert into `user_wallets` (`balance`, `created_at`, `currency_id`, `status`, `user_id`) values (0, '2025-05-04 23:06:00', 11, 1, 24)
---
    protected function createUserWallets($user){
        $currencies = Currency::active()->roleHasOne()->pluck("id")->toArray();
        $wallets = [];
        foreach($currencies as $currency_id) {
            if($user->wallets()->where('currency_id',$currency_id)->count() > 0) {
                continue;
            }
            $wallets[] = [
                'user_id'      => $user->id,
                'currency_id'   => $currency_id,
                'balance'       => 0,
                'status'        => true,
                'created_at'    => now(),
            ];
        }

        DB::table("user_wallets")->insert($wallets);

select count(*) as aggregate from `transaction_settings` where `slug` = 'money-in' and `currency_id` = 1
insert into `transaction_settings` (`admin_id`, `agent_fixed_commissions`, `agent_percent_commissions`, `agent_profit`, `currency_id`, `daily_limit`, `fixed_charge`, `max_limit`, `min_limit`, `monthly_limit`, `percent_charge`, `slug`, `status`, `title`, `type_commission`) values (1, 0, 0, 1, 6, 0, 0, 0, 0, 0, 0, 'money-in', 1, 'Money In Charges', 0), (1, 0, 0, 1, 7, 0, 0, 0, 0, 0, 0, 'money-in', 1, 'Money In Charges', 0), (1, 0, 0, 1, 11, 0, 0, 0, 0, 0, 0, 'money-in', 1, 'Money In Charges', 0)
---
    public function trxChargeUpdate()
    {
        $currencies = Currency::active()->roleHasOne()->pluck("id")->toArray();
        $transaction_setting = [];
        foreach($currencies as $currency_id) {

            if(TransactionSetting::where('slug','money-in')->where('currency_id',$currency_id)->count() > 0) {
                continue;
            }

            $transaction_setting[] = [
                'admin_id' => Auth::user()->id,
                'currency_id' => $currency_id,
                'slug' => 'money-in',
                'title' => 'Money In Charges',
                'fixed_charge' => 0,
                'percent_charge' => 0,
                'min_limit' => 0,
                'max_limit' => 0,
                'monthly_limit' => 0,
                'daily_limit' => 0,
                'status' => 1,
                'agent_fixed_commissions' => 0,
                'agent_percent_commissions' => 0,
                'agent_profit' => 1,
                'type_commission' => 0,
                'created_at' => now(),
                // 'paliers_commissions' => (object) [],
            ];
        }
        DB::table("transaction_settings")->insert($transaction_setting);