app/Http/Controllers/Admin/DashboardController.php

select sum(`total_charge`) as aggregate from `transaction_charges`
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '2024-09-01' and '2024-09-13'
---
        } */

        //total profits
        $total_profits = TransactionCharge::toBase()->sum('total_charge');

        $this_month_profits = TransactionCharge::toBase()
            ->whereBetween('created_at', [$this_month_start, $this_month_end])
            ->sum('total_charge');

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'REMITTANCE' and `status` != 4
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'REMITTANCE' and `status` = 1
---
        } */

        //Remittance
        $total_remittance = Transaction::toBase()->where('type', PaymentGatewayConst::SENDREMITTANCE)->where('status', '!=', 4)->sum('request_amount');
        $completed_remittance =  Transaction::toBase()
            ->where('type', PaymentGatewayConst::SENDREMITTANCE)
            ->where('status', 1)
            ->sum('request_amount');

select sum(`request_amount`) as aggregate from `transactions` where `type` = 'MONEY-IN' and `attribute` = 'SEND' and `status` != 4
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'MONEY-IN' and `attribute` = 'SEND' and `status` = 1
---
        }

        //Money In
        $total_money_in = Transaction::toBase()->where('type', PaymentGatewayConst::MONEYIN)->where('attribute', PaymentGatewayConst::SEND)->where('status', '!=', 4)->sum('request_amount');
        $completed_money_in =  Transaction::toBase()
            ->where('type', PaymentGatewayConst::MONEYIN)
            ->where('attribute', PaymentGatewayConst::SEND)
            ->where('status', 1)
            ->sum('request_amount');

select count(*) as aggregate from `users`
---
        }

        //Users
        $total_users = User::toBase()->count();

select count(*) as aggregate from `agents`
---
        } */

        //Agents
        $total_agents = Agent::toBase()->count();

select count(*) as aggregate from `user_support_tickets`
---
        }

        //Support Tikets
        $total_tickets = UserSupportTicket::toBase()->count();

select count(*) as aggregate from `transactions` where `type` = 'MONEY-IN' and `attribute` = 'SEND' and date(`created_at`) = '2024-09-01' and `status` = 2
---
            $Money_out_hold_data[]     = $money_hold; */

            // Monthley money in
            $money_pending = Transaction::where('type', PaymentGatewayConst::MONEYIN)
                ->where('attribute', PaymentGatewayConst::SEND)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();

select count(*) as aggregate from `blogs` where `status` = 1 and date(`created_at`) = '2024-09-01'
---

            // Event,Campaign,Gallery

            $event = Blog::where('status', 1)
                ->whereDate('created_at', $start_date)
                ->count();

update `admins` set `last_logged_out` = '2024-09-13 19:50:35', `login_status` = 0, `admins`.`updated_at` = '2024-09-13 19:50:35' where `id` = 1
---
    public function logout(Request $request)
    {

        // $push_notification_setting = BasicSettingsProvider::get()->push_notification_config;

        // if($push_notification_setting) {
        //     $method = $push_notification_setting->method ?? false;

        //     if($method == "pusher") {
        //         $instant_id     = $push_notification_setting->instance_id ?? false;
        //         $primary_key    = $push_notification_setting->primary_key ?? false;

        //         if($instant_id && $primary_key) {
        //             $pusher_instance = new PushNotifications([
        //                 "instanceId"    => $instant_id,
        //                 "secretKey"     => $primary_key,
        //             ]);

        //             $pusher_instance->deleteUser("".Auth::user()->id."");
        //         }
        //     }

        // }

        $admin = auth()->user();
        try {
            $admin->update([
                'last_logged_out'   => now(),
                'login_status'      => false,
            ]);