app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $page_title = __("Dashboard");
        $last_month_start =  date('01-m-Y', strtotime('-1 month', strtotime(date('d-m-Y'))));
        $last_month_end =  date('31-m-Y', strtotime('-1 month', strtotime(date('d-m-Y'))));
        $this_month_start = date('01-m-Y');
        $this_month_end = date('d-m-Y');
        $this_weak = date('d-m-Y', strtotime('-1 week', strtotime(date('d-m-Y'))));
        $this_month = date('d-m-Y', strtotime('-1 month', strtotime(date('d-m-Y'))));
        $this_year = date('d-m-Y', strtotime('-1 year', strtotime(date('d-m-Y'))));

        $transactions = Transaction::where('type', PaymentGatewayConst::TYPEADDSUBTRACTBALANCE)
                                ->whereDate('created_at', today())->latest()->take(10)->get();

        $recharges = Transaction::where('type', PaymentGatewayConst::TYPEADDSUBTRACTBALANCE)
                                ->whereDate('created_at', today())->sum('request_amount');

        $transactions2 = Transaction::where('type', PaymentGatewayConst::MONEYIN)->where('attribute', PaymentGatewayConst::SEND)
                                ->whereDate('created_at', today())
                                ->latest()->take(10)->get();

        $transactions3 = Transaction::join('agents', 'agents.id', '=', 'transactions.agent_id')
                        ->where('transactions.type', PaymentGatewayConst::MONEYIN)
                        ->where('transactions.attribute', PaymentGatewayConst::SEND)
                        ->whereDate('transactions.created_at', today())
                        ->groupBy('agents.matricule','agents.username','agents.full_mobile', 'agents.id', 'agents.firstname', 'agents.lastname', 'agents.email') // Important pour certains DB stricts
                        ->select('agents.matricule','agents.username','agents.full_mobile', 'agents.id', 'agents.firstname', 'agents.lastname', 'agents.email', DB::raw('SUM(transactions.request_amount) as montant'))
                        ->get();

        $collectes = Transaction::where('type', PaymentGatewayConst::MONEYIN)
                        ->where('attribute', PaymentGatewayConst::SEND)
                        ->whereDate('created_at', today())
                        ->sum('request_amount');
---
select * from `transactions` where `type` = 'ADD-SUBTRACT-BALANCE' and date(`created_at`) = '2025-05-05' order by `created_at` desc limit 10
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-SUBTRACT-BALANCE' and date(`created_at`) = '2025-05-05'
select * from `transactions` where `type` = 'MONEY-IN' and `attribute` = 'SEND' and date(`created_at`) = '2025-05-05' order by `created_at` desc limit 10
select `agents`.`matricule`, `agents`.`username`, `agents`.`full_mobile`, `agents`.`id`, `agents`.`firstname`, `agents`.`lastname`, `agents`.`email`, SUM(transactions.request_amount) as montant from `transactions` inner join `agents` on `agents`.`id` = `transactions`.`agent_id` where `transactions`.`type` = 'MONEY-IN' and `transactions`.`attribute` = 'SEND' and date(`transactions`.`created_at`) = '2025-05-05' group by `agents`.`matricule`, `agents`.`username`, `agents`.`full_mobile`, `agents`.`id`, `agents`.`firstname`, `agents`.`lastname`, `agents`.`email`
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'MONEY-IN' and `attribute` = 'SEND' and date(`created_at`) = '2025-05-05'

        } */

        //total profits
        $total_profits = TransactionCharge::toBase()->sum('total_charge');

        $this_month_profits = TransactionCharge::toBase()
            ->whereBetween('created_at', [Carbon::today()->firstOfMonth(), Carbon::today()->lastOfMonth()])
            ->sum('total_charge');

        $last_month_profits = TransactionCharge::toBase()
            ->whereBetween('created_at', [Carbon::today()->subMonth()->firstOfMonth(), Carbon::today()->subMonth()->lastOfMonth()])
            ->sum('total_charge');
---
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '2024-09-01' and '2024-09-13'
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '2025-05-01 00:00:00' and '2025-05-31 00:00:00'
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '2025-04-01 00:00:00' and '2025-04-30 00:00:00'

        }

        //agent profits
        $agent_profits = TransactionCharge::toBase()->sum('total_charge');

        $this_month_agents_profits = TransactionCharge::toBase()
            ->whereBetween('created_at', [$this_month_start, $this_month_end])
            ->sum('total_charge');

        $last_month_agents_profits = TransactionCharge::toBase()
            ->whereBetween('created_at', [$last_month_start, $last_month_end])
            ->sum('total_charge');
---
select sum(`total_charge`) as aggregate from `transaction_charges`
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '01-05-2025' and '05-05-2025'
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '01-04-2025' and '31-04-2025'

        } */

        //Remittance
        $total_remittance = Transaction::toBase()->where('type', PaymentGatewayConst::SENDREMITTANCE)->where('status', '!=', 4)->sum('request_amount');
        $completed_remittance =  Transaction::toBase()
            ->where('type', PaymentGatewayConst::SENDREMITTANCE)
            ->where('status', 1)
            ->sum('request_amount');
        $pending_remittance =  Transaction::toBase()->where('status', 2)
            ->where('type', PaymentGatewayConst::SENDREMITTANCE)
            ->sum('request_amount');
---
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'REMITTANCE' and `status` != 4
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'REMITTANCE' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'REMITTANCE'

        }

        //Money In
        $total_money_in = Transaction::toBase()->where('type', PaymentGatewayConst::MONEYIN)->where('attribute', PaymentGatewayConst::SEND)->where('status', '!=', 4)->sum('request_amount');
        $completed_money_in =  Transaction::toBase()
            ->whereBetween('created_at', [Carbon::today()->firstOfMonth(), Carbon::today()->lastOfMonth()])
            ->where('type', PaymentGatewayConst::MONEYIN)
            ->where('attribute', PaymentGatewayConst::SEND)
            ->where('status', 1)
            ->sum('request_amount');
        $pending_money_in =  Transaction::toBase()->where('status', 2)
            ->whereBetween('created_at', [Carbon::today()->firstOfMonth(), Carbon::today()->lastOfMonth()])
            ->where('type', PaymentGatewayConst::MONEYIN)
            ->where('attribute', PaymentGatewayConst::SEND)
            ->sum('request_amount');
---
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'MONEY-IN' and `attribute` = 'SEND' and `status` != 4
select sum(`request_amount`) as aggregate from `transactions` where `created_at` between '2025-05-01 00:00:00' and '2025-05-31 00:00:00' and `type` = 'MONEY-IN' and `attribute` = 'SEND' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `created_at` between '2025-05-01 00:00:00' and '2025-05-31 00:00:00' and `type` = 'MONEY-IN' and `attribute` = 'SEND'

        }

        //Users
        $total_users = User::toBase()->count();
---
select count(*) as aggregate from `users`

        } */

        //Agents
        $total_agents = Agent::toBase()->count();
---
select count(*) as aggregate from `agents`

        }

        //Support Tikets
        $total_tickets = UserSupportTicket::toBase()->count();
---
select count(*) as aggregate from `user_support_tickets`

            $Money_out_hold_data[]     = $money_hold; */

            // Monthley money in
            $money_pending = Transaction::where('type', PaymentGatewayConst::MONEYIN)
                ->whereBetween('created_at', [Carbon::today()->firstOfMonth(), Carbon::today()->lastOfMonth()])
                ->where('attribute', PaymentGatewayConst::SEND)
                ->whereDate('created_at', $start_date)
                ->where('status', 2)
                ->count();
            $money_success = Transaction::where('type', PaymentGatewayConst::MONEYIN)
                ->whereBetween('created_at', [Carbon::today()->firstOfMonth(), Carbon::today()->lastOfMonth()])
                ->where('attribute', PaymentGatewayConst::SEND)
                ->whereDate('created_at', $start_date)
                ->where('status', 1)
                ->count();
            $money_canceled = Transaction::where('type', PaymentGatewayConst::MONEYIN)
                ->whereBetween('created_at', [Carbon::today()->firstOfMonth(), Carbon::today()->lastOfMonth()])
                ->where('attribute', PaymentGatewayConst::SEND)
                ->whereDate('created_at', $start_date)
                ->where('status', 4)
                ->count();
            $money_hold = Transaction::where('type', PaymentGatewayConst::MONEYIN)
                ->whereBetween('created_at', [Carbon::today()->firstOfMonth(), Carbon::today()->lastOfMonth()])
                ->where('attribute', PaymentGatewayConst::SEND)
                ->whereDate('created_at', $start_date)
                ->where('status', 3)
                ->count();
---
select count(*) as aggregate from `transactions` where `type` = 'MONEY-IN' and `created_at` between '2025-05-01 00:00:00' and '2025-05-31 00:00:00' and `attribute` = 'SEND' and date(`created_at`) = '2025-05-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'MONEY-IN' and `created_at` between '2025-05-01 00:00:00' and '2025-05-31 00:00:00' and `attribute` = 'SEND' and date(`created_at`) = '2025-05-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'MONEY-IN' and `created_at` between '2025-05-01 00:00:00' and '2025-05-31 00:00:00' and `attribute` = 'SEND' and date(`created_at`) = '2025-05-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'MONEY-IN' and `created_at` between '2025-05-01 00:00:00' and '2025-05-31 00:00:00' and `attribute` = 'SEND' and date(`created_at`) = '2025-05-01' and `status` = 3


            // Event,Campaign,Gallery

            $event = Blog::where('status', 1)
                ->whereDate('created_at', $start_date)
                ->count();
---
select count(*) as aggregate from `blogs` where `status` = 1 and date(`created_at`) = '2025-05-01'