app/Http/Controllers/Admin/ExchangeRateController.php

    public function index()
    {
        $page_title = __("Exchange Rate");
        $exchange_rates = ExchangeRate::orderBy('name', 'asc')->where('status', 1)->paginate(20);
---
select * from `exchange_rates` where `status` = 1 order by `name` asc limit 20 offset 0
select count(*) as aggregate from `exchange_rates` where `status` = 1