app/Http/Controllers/Admin/MoneyOutController.php

select * from `agents`
select * from `transactions` where `type` = 'MONEY-OUT' and `status` = 1 and `cbsTransfert` = 'ND' order by `created_at` desc limit 20 offset 0
select `id`, `firstname`, `lastname`, `email`, `username`, `full_mobile` from `users` where `users`.`id` in (29, 30, 31)
select count(*) as aggregate from `transactions` where `type` = 'MONEY-OUT' and `status` = 1 and `cbsTransfert` = 'ND'
---
    public function cbsPending()
    {
        $page_title =  __("CBS Pending Logs");
        $agents = Agent::all();
        $transactions = Transaction::with(
            'user:id,firstname,lastname,email,username,full_mobile',
            'currency:id,name,alias,payment_gateway_id,currency_code,rate',
        )->where('type', PaymentGatewayConst::TYPEMONEYOUT)->where('status', 1)->where('cbsTransfert', 'ND')->latest()->paginate(20);