app/Http/Controllers/Admin/SetupSMSController.php

select * from `basic_settings` limit 1
---
    public function configuration()
    {
        $page_title = "SMS Gateway";
        $sms_config = BasicSettings::first()->sms_config;

select * from `basic_settings` limit 1
update `basic_settings` set `sms_config` = '{\"url\":\"http:\/\/172.19.70.170:82\/api\/v3\/sms\/send\",\"token\":\"1|j8KbzuuFE1a6cXYFIivrlA3AY8apy9mvHMdeWorm\",\"sender_id\":\"INTELLIGENTSIA\",\"app_name\":\"IPAY\"}', `basic_settings`.`updated_at` = '2024-09-13 17:21:15' where `id` = 1
---
    public function update(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'url'           => 'required|string|max:255',
            'token'         => 'required|string|max:150',
            'sender_id'     => 'required|string|max:50',
        ]);

        $validated = $validator->validate();

        $basic_settings = BasicSettings::first();
        if (!$basic_settings) {
            return back()->with(['error' => [__("Basic settings not found!")]]);
        }

        // Make object of sms template
        $data = [
            'url'               => $validated['url'] ?? false,
            'token'             => $validated['token'] ?? false,
            'sender_id'         => $validated['sender_id'] ?? false,
            'app_name'          => $basic_settings['site_name'] ?? env("APP_NAME"),
        ];

        try {
            $basic_settings->update([
                'sms_config'       => $data,
            ]);