app/Http/Controllers/Admin/TrxSettingsController.php

select * from `currencies` where `currencies`.`id` in (1, 6, 7, 11)
select * from `transaction_settings`
select * from `basic_settings` limit 1
---
    public function index()
    {
        $page_title = __("Fees & Charges");
        $transaction_charges = TransactionSetting::with('currency')->get();
        $basic_settings = BasicSettings::first();

select * from `transaction_settings` where `slug` = 'money-in' and `currency_id` = '7' limit 1
select * from `transaction_settings` where `slug` = 'money-in' limit 1
update `transaction_settings` set `percent_charge` = '2', `min_limit` = '50', `max_limit` = '5000', `agent_percent_commissions` = '0.8', `transaction_settings`.`updated_at` = '2025-05-04 23:39:21' where `id` = 14
---
    public function trxChargeUpdate(Request $request)
    {
        $transaction_setting = TransactionSetting::where('slug', $request->slug)->where('currency_id', $request->currency_id)->first();
        if (!$transaction_setting) return back()->with(['error' => [__("Transaction charge not found!")]]);
        if ($transaction_setting->agent_profit == true) {
            $agent_percent_commission   = 'required|numeric';
            $agent_fixed_commission     = 'required|numeric';
        } else {
            $agent_percent_commission   = 'sometimes|required|numeric';
            $agent_fixed_commission     = 'sometimes|required|numeric';
        }
        $validator = Validator::make($request->all(), [
            'slug'                                          => 'required|string',
            $request->slug . '_fixed_charge'                  => 'required|numeric',
            $request->slug . '_percent_charge'                => 'required|numeric',
            $request->slug . '_min_limit'                     => 'required|numeric',
            $request->slug . '_max_limit'                     => 'required|numeric',
            $request->slug . '_daily_limit'                   => 'sometimes|required|numeric',
            $request->slug . '_monthly_limit'                 => 'sometimes|required|numeric',
            $request->slug . '_agent_percent_commissions'      => $agent_percent_commission,
            $request->slug . '_agent_fixed_commissions'        => $agent_fixed_commission,
        ]);
        $validated = $validator->validate();
        $validated = replace_array_key($validated, $request->slug . "_");

        try {
            $transaction_setting->update($validated);