app/Http/Controllers/Admin/WebSettingsController.php

select * from `basic_settings` limit 1
---
    public function basicSettings()
    {
        $page_title = __("Basic Settings");
        $basic_settings   = BasicSettings::first();

update `basic_settings` set `agent_push_notification` = 1, `basic_settings`.`updated_at` = '2025-05-05 08:06:24' where `id` = 1
---


        try {
            $basic_settings->update([
                $validated['input_name'] => $validated['status'],
            ]);